Repository: 84000/data-translation-memory
Catalog: toh181-v4.tmx
Source language: bo
Languages: en

source: །སྟོང་གི་ཆ་དང་། འབུམ་གྱི་ཆ་དང་། བྱེ་བའི་ཆ་དང་། བྱེ་བ་འབུམ་གྱི་ཆ་དང་།
en: Nor would they measure a thousandth, a hundred thousandth, a millionth, or a trillionth of that.

source: གྲངས་དང་། ཆ་དང་། བགྲང་བ་དང་། དཔེ་དང་། རྒྱུར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: In fact, no number, fraction, enumeration, analogy, or comparison would suffice.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་སེམས་བསྐྱེད་པ་དེས་ཐམས་ཅད་ཟིལ་གྱིས་ནོན་པའི་ཕྱིར་རོ།
en: Because the mindset of the bodhisattvas who rejoice in that manner surpasses anything else.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འདི་ཉིད་ཀྱིས་འདིར་ཐབས་ལ་མཁས་པ་ཉིད་བཙན་པར་མཛད་དོ།
en: Venerable Pūrṇa, in this regard the blessed Buddha is the lord of skillful means. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་གལ་ཏེ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་གནས་ཤིང་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་སྦྱིན་པ་དག་ཀྱང་སྦྱིན་ཞིང་བསོད་ནམས་དག་ཀྱང་བྱེད་ལ།
en: Venerable Pūrṇa, moreover, imagine if all those beings lived for as many eons as there are grains of sand in the Ganges and practiced generosity toward the Buddha and the community of monks, thereby creating merit.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྗེས་སུ་ཡི་རང་སྟེ། ཀྱེ་མ་སྦྱིན་པ་འདི་ནི་ལེགས་པར་བྱིན་ནོ།
en: Now, a bodhisattva might rejoice in that generosity, thinking, ‘Oh my, how generous!

source: །ལེགས་པར་སྦྱིན་པར་བྱེད་དོ།
en: What excellent acts of generosity!

source: །བསྟི་སྟང་དུ་བྱས་ཏེ་སྦྱིན་པར་བྱེད་དོ་ཞེ་སར་བྱས་ཏེ་སྦྱིན་པར་བྱེད་དོ།
en: They are engaged in generosity with such veneration and respect!

source: །སྨད་པ་མེད་པར་སྦྱིན་པར་བྱེད་དོ།
en: What faultless acts of giving!

source: །སྦྱིན་པ་འདི་ལ་རྗེས་སུ་ཡི་རང་ངོ་ཞེ་ན།
en: I rejoice in this generosity!’

source: བྱང་ཆུབ་སེམས་དཔའ་དེའི་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་སེམས་ལ་སྔ་མའི་སྦྱིན་པ་དང་ལྡན་པའི་བསོད་ནམས་མངོན་པར་འདུ་བྱེད་པ་དེས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: Comparatively, the merit of those who at first performed the generosity would not constitute even one percent of that created by the bodhisattva’s thought to rejoice.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ནི་རྗེས་སུ་ཡི་རང་བའི་སེམས་ཀྱིས་ཟིལ་གྱིས་གནོན་པར་བྱེད་པར་རིག་པར་བྱའོ།
en: Because the bodhisattva’s thought to rejoice in that manner surpasses anything else. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན་ཟླ་བའི་དཀྱིལ་འཁོར་འཆར་བ་ན་སྐར་མའི་གཟུགས་གང་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱི་འོད་མེད་པར་བྱེད་དོ།
en: Venerable Pūrṇa, when the full moon rises, all the many stars lose their luster.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན་ཉི་མའི་དཀྱིལ་འཁོར་འཆར་བ་ན་འཛམ་བུའི་གླིང་འདི་སྲོག་ཆགས་ཀྱི་རིགས་སྲིན་བུ་མེ་ཁྱེར་གྱིས་གང་བར་གྱུར་པ་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ཏེ་འོད་མེད་པར་བྱེད་དོ།
en: And, Venerable Pūrṇa, when the sun’s disc rises, it outshines all the fireflies in the world and makes them lose their luster.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན་མཆིང་བུའི་ནོར་བུ་བརྒྱ་འམ། སྟོང་ངམ།
en: Venerable Pūrṇa, you may have a hundred, or a thousand, or ten million, or a billion semiprecious stones.

source: བྱེ་བའམ། བྱེ་བ་སྟོང་ཕུང་པོ་ཆེན་པོར་གྱུར་ལ། དེའི་ནང་དུ་བཻ་དཱུརྱའི་ནོར་བུ་གཅིག་བཞག་ན་མཆིང་བུའི་ནོར་བུ་དེ་ཐམས་ཅད་ནོར་བུ་རིན་པོ་ཆེ་བཻ་དཱུརྱ་གཅིག་པུའི་ཁ་དོག་དང་འོད་ཀྱིས་ཟིལ་གྱིས་གནོན་པར་འགྱུར་ཏེ། འོད་མི་སྣང་ཞིང་མི་སྤ་བར་འགྱུར་རོ།
en: However, if you placed a single beryl among them, the color and shine of that single beryl gem would surpass all the semiprecious stones and their luster would fade and disappear.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་བསྐལ་པ་དཔག་ཏུ་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་གནས་པའི་སྦྱིན་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེའི་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་སེམས་ཀྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས་རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: Venerable Pūrṇa, in the same way, the mass of merit that arose from the generosity of all those beings, who practiced generosity for as many limitless eons as there are grains of sand in the Ganges, would not constitute even one percent of the merit created by the bodhisattva’s thought to rejoice. Nor would it measure a thousandth, a hundred thousandth, a millionth, or a trillionth of that. In fact, no number, fraction, enumeration, analogy, or comparison would suffice. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། རྟ་རིན་པོ་ཆེ་རྟ་སྟོང་གི་ནང་དུ་ཞུགས་ན། རྟ་ཕལ་དེ་དག་ཐམས་ཅད་གསལ་བ་མ་ཡིན་ཞིང་སྤ་བ་མ་ཡིན་ལ།
en: Venerable Pūrṇa, if you placed the precious horse among a thousand common horses, none of those horses would seem special or stunning.

source: རྟའི་རྒོད་པའི་བག་ཀྱང་སྟོན་པར་མི་བྱེད་དེ། དེ་དག་ཐམས་ཅད་རྟ་རིན་པོ་ཆེ་དེས་ཟིལ་གྱིས་གནོན་པར་འགྱུར་རོ།
en: They would not show any of the wild moods of a horse either, because the precious horse would surpass all of them.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་གནས་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱི་སྦྱིན་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་གང་ཡིན་པ་དེ།
en: Venerable Pūrṇa, in the same way, the mass of merit that arose from the generosity of all those beings, who practiced generosity for as many eons as there are grains of sand in the Ganges, would not constitute even one percent of the merit created by the bodhisattva’s thought to rejoice.

source: བྱང་ཆུབ་སེམས་དཔའི་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་སེམས་ཀྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས་རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོ་སྟེ།
en: Nor would it measure a thousandth, a hundred thousandth, a millionth, or a trillionth of that. In fact, no number, fraction, enumeration, analogy, or comparison would suffice.

source: དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔས་རྗེས་སུ་ཡི་རང་བའི་སེམས་ཀྱིས་ཟིལ་གྱིས་གནོན་པར་འགྱུར་རོ།
en: The bodhisattva’s thought to rejoice would surpass it all. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ཀྱང་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་པ་གྲངས་མེད་པ་དག་ན་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གནས་པ་དེ་དག་ནི་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཅིག །ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གནས་པ་དེ་དག་ནི་མྱུར་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །ཅེས་ཡོངས་སུ་བསྔོ་བར་བྱའོ།
en: Venerable Pūrṇa, moreover, that bodhisattva great being would dedicate the merit, saying, ‘By the mass of merit that has been created through rejoicing, may all bodhisattva great beings in all the limitless and countless worlds who have newly entered this vehicle reach the state of nonregression, and may all those who have reached the state of nonregression swiftly perfect the state of omniscience.’ “

source: །ཇི་ལྟ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་རྩ་བ་དེ་ཡོངས་སུ་གཏོང་བ་དེ་ལྟ་དེ་ལྟར་སྣང་བར་འགྱུར་ཞིང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བར་འགྱུར་རོ།
en: The more bodhisattvas are able to give away their roots of virtue, the more they will manifest, and the closer they will be to the state of omniscience.

source: །ཇི་ལྟ་ཇི་ལྟར་དགེ་བའི་རྩ་བ་དེ་དག་བདག་གིར་མི་བྱེད་ཅིང་། དགེ་བའི་རྩ་བ་འདིས་སེམས་ཅན་ཐམས་ཅད་བདེ་བར་གྱུར་ཅིག་ཅེས་སེམས་བསྐྱེད་པ་དེ་ལྟ་དེ་ལྟར་དགེ་བའི་རྩ་བ་རྣམས་ཀྱིས་འབོགས་པར་འགྱུར་རོ།
en: The more they can avoid becoming possessive of their roots of virtue and wish that their roots of virtue may lead to all beings’ happiness, the more those roots of virtue will enable them to excel.

source: །ཇི་ལྟ་ཇི་ལྟར་དགེ་བའི་རྩ་བ་རྣམས་ཀྱིས་འབོགས་པ་དེ་ལྟ་དེ་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བར་འགྱུར་རོ།
en: The more they excel by means of their roots of virtue, the closer they will be to the state of omniscience.

source: །ཇི་ལྟ་ཇི་ལྟར་དགེ་བའི་རྩ་བ་དེ་དག་ལ་བདག་གི་བར་སེམས་མི་སྐྱེད་པ་དེ་ལྟ་དེ་ལྟར་དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་འཛིན་ཏོ།
en: The more they avoid thinking of the roots of virtue as their own, the more boundless will be the roots of virtue they possess.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྗེས་སུ་ཡི་རང་བའི་སེམས་ཐབས་ལ་མཁས་པས་ཡོངས་སུ་བསྔོས་ནས་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཕན་འདོགས་པར་བྱེད་དེ་རྗེས་སུ་འཛིན་ཅིང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་མངོན་པར་ཤེས་པ་མྱུར་བར་ཡོངས་སུ་སྔོའོ།
en: Venerable Pūrṇa, likewise, bodhisattva great beings who rejoice are skilled in means, so when they dedicate the merit, the dedication is directed toward benefiting and looking after those bodhisattvas who have newly entered this vehicle and ensuring that the nonregressing bodhisattvas quickly obtain higher knowledge.

source: །དེས་དེ་དག་ལ་ཡང་ཕན་བཏགས་ནས་བདག་ཉིད་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་འཛིན་པར་བྱེད་པ་འདི་ནི།
en: In this way they are assisted while the bodhisattvas themselves attain the state of omniscience. “

source: ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའི་ཐབས་ལ་མཁས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Venerable Pūrṇa, you should understand that this is what is meant by bodhisattvas being skilled in means.

source: འདི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པའི་ཕྱིར་ཏེ། བདག་དང་དེ་ལས་གཞན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱང་དོན་ཆེ་བར་བྱེད་དོ།
en: Because they dedicate to the state of omniscience in this manner and because they benefit themselves and other bodhisattva great beings immensely.”

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་རྗེས་སུ་ཡི་རང་བའི་ལེའུ་སྟེ་དང་པོའོ།། །།
en: This concludes the first chapter from “The Perfection of Generosity” entitled “Rejoicing.”

source: ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་གནས་པའི་སེམས་ཅན་དེ་ཐམས་ཅད་ཀྱིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་སྦྱིན་པ་སྦྱིན་པ་དང་། བསོད་ནམས་དག་ཀྱང་བྱེད་པ་གང་ཡིན་པ་དང་།
en: “Venerable Pūrṇa, moreover, imagine the merit that would be created if all beings were to perform acts of generosity toward the Buddha and the assembly of monks for as many eons as there are grains of sand in the Ganges.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་བསོད་སྙོམས་ལན་ཅིག་ཙམ་འབུལ་ན་ཡང་། བསོད་སྙོམས་འབུལ་བ་གང་ཡིན་པ་འདི་ལ་དགེ་བའི་རྩ་བ་སྔ་མས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས་རྒྱུའི་བར་དུ་ཡང་མི་བཟོད་དོ།
en: If you compare that with the merit that comes from a bodhisattva great being offering the Buddha and the assembly of monks a single meal, the merit of the former would not constitute even one percent of the merit of offering the meal. Nor would it measure a thousandth, a hundred thousandth, a millionth, or a trillionth of that. In fact, no number, fraction, enumeration, analogy, or comparison would suffice.

source: ཡོངས་སུ་བསྔོས་པའི་ཕྱིར་རོ།
en: Because of the dedication of merit. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་དང་སེམས་ཅན་དེ་དག་གི་ལེན་པ་པོ་ནི་མཚུངས་ཏེ།
en: Venerable Pūrṇa, the recipient of the generosity of that bodhisattva and of those beings is the same here.

source: ལེན་པ་པོ་མི་མཚུངས་པ་མ་ཡིན་མོད་ཀྱི། བསྔོ་བ་དང་བྲལ་བའི་ཕྱིར་སེམས་ཅན་དེ་དག་གི་སྦྱིན་པ་དེ། བྱང་ཆུབ་སེམས་དཔའི་སྦྱིན་པའི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས་རྒྱུའི་བར་དུ་ཡང་མི་བཟོད་དོ། །
en: Yet, although the recipient is no different, the generosity of beings lacks a dedication and therefore it does not constitute even one percent of the merit of the bodhisattva.

source: ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་སྦྱིན་པ་ན། འདི་ལྟར་བདག་གིས་སྦྱིན་པ་འདི་ལྟར་བྱིན་ཞིང་།
en: Venerable Pūrṇa, moreover, when bodhisattva great beings practice generosity, they should make the aspiration,

source: འདི་ལྟར་ཡོངས་སུ་བཏང་བ་ལས་བསོད་ནམས་མངོན་པར་འདུ་བྱེད་པ་གང་ཡིན་པ་དང་།དགེ་བ་མངོན་པར་འདུ་བྱེད་པ་གང་ཡིན་པའི་དགེ་བ་མངོན་པར་འདུ་བྱེད་པ་དེས་སེམས་ཅན་དམྱལ་བའི་སེམས་ཅན་རྣམས། སེམས་ཅན་དམྱལ་བ་ནས་འདོན་པར་གྱུར་ཅིག །དུད་འགྲོའི་སྐྱེ་གནས་སུ་སྐྱེས་པའི་སེམས་ཅན་རྣམས་དུད་འགྲོའི་སྐྱེ་གནས་ནས་འདོན་པར་གྱུར་ཅིག །གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་སེམས་ཅན་རྣམས། གཤིན་རྗེའི་འཇིག་རྟེན་ནས་འདོན་པར་གྱུར་ཅིག །འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་དག་ན་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་གནས་པ་དེ་དག་ནི་ཕྱིར་མི་ལྡོག་པ་ཉིད་དུ་གྱུར་ཅིག །ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གནས་པ་དེ་དག་ནི་མྱུར་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག་ཅེས་སེམས་བསྐྱེད་པར་བྱ་སྟེ།
en: ‘Now that I have given this gift in this manner, may the virtue that has been created—the merit and the goodness that have been created—be the cause of all beings in hell being freed from their hellish states; may all those beings who have been born as animals be freed from the animal realm; may all beings living in the realm of the Lord of Death be freed from it; may all bodhisattva great beings in all the limitless and endless worlds who have newly entered this vehicle reach the state of nonregression; and may all nonregressing bodhisattvas quickly perfect the state of omniscience!’

source: ཇི་ལྟ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་རྩ་བ་དེ་དག་སྐྱེད་པ་དེ་ལྟ་དེ་ལྟར་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པར་བྱེད་དེ། དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་ཡང་རྣམ་པར་འཕེལ་བར་བྱེད་ཅིང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཡང་ཉེ་བར་འགྱུར་ཏེ།
en: The more bodhisattvas create roots of virtue, the more they will master the perfection of generosity and increase the roots of virtue limitlessly, and that much closer will they be to the state of omniscience.

source: འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐབས་ལ་མཁས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: You should understand that such is the bodhisattvas’ skill in means.

source: །ཇི་ལྟ་ཇི་ལྟར་དགེ་བའི་རྩ་བ་རྣམས་ལ་བདག་གི་བར་འདུ་ཤེས་མི་བྱེད་པ་དེ་ལྟ་དེ་ལྟར་བསོད་ནམས་དཔག་ཏུ་མེད་པ་མངོན་པར་འདུ་བྱེད་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: The more they avoid thinking of the roots of virtue as their own, the more they increase the merit limitlessly.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་ཡིན་ནོ།
en: Venerable Pūrṇa, this is how bodhisattva great beings give away all of their possessions.

source: །དགེ་བའི་རྩ་བ་གཟུགས་མེད་པ་གང་ཡིན་པ་ཡང་ཡོངས་སུ་གཏོང་ན་གཟུགས་ཡོད་པའི་དངོས་པོ་ལྟ་ཅི་སྨོས་ཏེ།
en: Since they give away their roots of virtue, which are immaterial, what need is there to mention material things?

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུགས་ཡོད་པ་དང་། གཟུགས་མེད་པའི་དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་ཡིན་ཏེ།
en: Therefore, bodhisattva great beings give away everything, both material and immaterial.

source: ཐམས་ཅད་ཡོངས་སུ་གཏོང་བས་ན། དེ་ཐམས་ཅད་མཁྱེན་པར་འགྱུར་རོ། །
en: And since they give away everything, they achieve omniscience.

source: འདི་སྐད་དུ་ནང་གིའམ། ཕྱི་རོལ་གྱི་འམ། གཟུགས་ཡོད་པའམ། གཟུགས་མེད་པ་ཡང་རུང་སྟེ། གང་བདག་གིས་ཡོངས་སུ་མ་བཏང་བའམ། མ་བྱིན་པའམ། མཆོད་སྦྱིན་མ་བྱས་པའི་ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: Such bodhisattvas proclaim, ‘I do not see anything, whether internal or external, whether material or immaterial, that I will not relinquish, give away, or make an offering of.

source: དངོས་པོ་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: I do not see any such thing.’

source: །ཞེས་ཀྱང་སེང་གེའི་སྒྲ་སྒྲོག་ཅིང་དེ་ལྟར་དགའ་བ་སྐྱེད་དོ།
en: With this lion’s roar they cause joy. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱིས་གཟིགས་ཏེ།
en: Venerable Pūrṇa, once bodhisattva great beings awaken to unsurpassed and perfect buddhahood, they perceive by means of the wisdom of omniscience.

source: འདི་སྐད་དུ་ནང་གིའམ། ཕྱི་རོལ་གྱིའམ། གཟུགས་ཡོད་པའམ། གཟུགས་མེད་པ་ཡང་རུང་སྟེ། གང་བདག་གིས་ཡོངས་སུ་མ་བཏང་བའམ། མ་བྱིན་པའམ། མཆོད་སྦྱིན་མ་བྱས་པའི་ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: At that point they let out a lion’s roar, proclaiming, ‘I do not see anything, whether internal or external, whether material or immaterial, that I have not relinquished, given away, or offered.

source: གང་གི་ཕྱིར་བདག་གིས་དངོས་པོ་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་དེའི་ཕྱིར་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། གང་བདག་གིས་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་པའམ། ཡོངས་སུ་མ་ཤེས་པའི་ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Because I do not see any such thing, I have awakened to unsurpassed and perfect buddhahood and now I do not see anything that I have not awakened to or that I do not understand.

source: །ཇི་ལྟར་ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་དེ་ལྟར་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཆོས་ཐམས་ཅད་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དམ་པ་ཐོབ་སྟེ།
en: Just as I do not see any such thing, so have I awakened to unsurpassed and perfect buddhahood and obtained the sacred perfection of all phenomena.

source: གང་བདག་གིས་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་པའམ། ཡོངས་སུ་མ་ཤེས་པ་དེ་ཅི་ཡང་མེད་དོ།
en: Now there is nothing whatsoever that I have not awakened to or that I do not understand.

source: །ཇི་ལྟར་གང་བདག་གིས་ཡོངས་སུ་མ་བཏང་བའམ། མ་བྱིན་པ་དེ་ཅི་ཡང་མེད་པ་དེ་ལྟར་བདག་གིས་ཆོས་གང་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་པའམ། ཡོངས་སུ་མ་ཤེས་པའི་ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་སེང་གེའི་སྒྲ་སྒྲོག་གོ།
en: Just as there is nothing whatsoever that I have not relinquished or given away, so also do I not see anything that I have not awakened to or that I do not understand.’ “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དེ་ལྟར་ནང་དང་ཕྱི་རོལ་གྱི་དངོས་པོ་རྣམས་ཡོངས་སུ་བཏང་བས་ན། ནང་དང་ཕྱིའི་ཆོས་རྣམས་ལ་ཆོས་གང་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་པའམ། ཡོངས་སུ་མ་ཤེས་པའི་ཆོས་ཅི་ཡང་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་སྟེ།
en: Venerable Pūrṇa, since bodhisattva great beings relinquish all inner and outer things in this way, they see that, among all inner and outer phenomena, there is nothing whatsoever that they do not awaken to or that they do not understand.

source: ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་བསླབ་པར་བྱའོ།
en: Venerable Pūrṇa, this is how bodhisattva great beings should train in the perfection of generosity.

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་སློབ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བའི་མིང་ཐོབ་ཅིང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་ཡང་མི་འབྲལ་བར་འགྱུར་རོ།
en: When bodhisattvas train in this manner, they receive the name ‘bodhisattva’ and become inseparable from the mind of omniscience.

source: །གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་མི་འབྲལ་བ་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ལ་བདུད་སྡིག་ཅན་གྱིས་ཀྱང་གླགས་མི་རྙེད་ན། གནོད་སྦྱིན་ནམ་ཤ་ཟས་གླགས་རྙེད་པ་ལྟ་ཅི་སྨོས་ཏེ་འདི་ནི་གནས་མེད་དོ།
en: Whenever bodhisattva great beings become inseparable from the mind of omniscience, the evil Māra will have no opportunity to cause harm, let alone the yakṣas and piśācas—it would be impossible for them to cause any harm. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་ཕྱོགས་གང་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་སེམས་ཤིང་འགྲོ་བའི་ཕྱོགས་དེར་མིའམ། མི་མ་ཡིན་པ་རྣམས་ཀྱིས་གླགས་མི་རྙེད་དོ།
en: Venerable Pūrṇa, anywhere bodhisattvas go while bringing to mind the properties of omniscience, no human or nonhuman being will find an opportunity to cause them harm.

source: ཡིད་ལ་བྱེད་པ་དེ་དག་ནི་དེ་ལྟར་སྟོབས་དང་ལྡན་པའི་ཕྱིར་རོ།
en: Because such considerations possess that much power.

source: །འདི་ལྟར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱེད་པ་རྣམས་ནི་དེ་ལྟར་བསམ་གྱིས་མི་ཁྱབ་ཅིང་དེ་ལྟར་རྒྱ་ཆེའོ།
en: Thus, bringing omniscience to mind in this way has such inconceivable and vast benefits.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་ནི་དེ་ལྟར་སེམས་ཅན་རྣམས་ལ་ཕན་འདོགས་པ་ཡང་ཡིན་ལ་ཉེ་བར་འཚོ་བ་ཡང་ཡིན་ནོ།
en: Venerable Pūrṇa, the actions performed by bodhisattva great beings for the sake of awakening benefit beings in this way and take care of them. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་རྣམ་གྲངས་འདིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་ཏོ།
en: Venerable Pūrṇa, in this way, bodhisattva great beings surpass all childish and ordinary beings as well as all the hearers and solitary buddhas.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་ཕན་འདོགས་པར་གྱུར་པ་དང་ཉེ་བར་འཚོ་བ་ཡིན་ནོ།
en: Awakening to unsurpassed and perfect buddhahood, they benefit and take care of these beings.

source: །སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པ་སྤངས་པའི་ཕྱིར་ཆོས་ཀྱང་སྟོན་ཏོ།
en: In order to eradicate the disturbing emotions of beings, they also teach the Dharma.

source: །སེམས་ཅན་དཔག་ཏུ་མེད་པ་ཡང་ཕུང་པོ་གསུམ་དུ་ཡོངས་སུ་མྱ་ངན་ལས་ཟློ་བར་བྱེད་དོ།
en: They also bring to nirvāṇa limitless beings within the three groups of beings. “Venerable Pūrṇa, that is how bodhisattva great beings awaken to unsurpassed and perfect buddhahood.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་རྣམ་གྲངས་འདིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་མཆོག་ཅེས་བྱ། གཙོ་བོ་དང་། ཕུལ་དང་།
en: Then, compared to all childish and ordinary beings as well as all the hearers and solitary buddhas, they are known as ‘the supreme, foremost, superior, preeminent, sublime, unsurpassed, and unexcelled beings.’

source: རབ་དང་། རབ་མཆོག་དང་། བླ་ན་མེད་པ་དང་གོང་ན་མེད་པ་ཞེས་བྱའོ། །ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་ཕན་འདོགས་པར་གྱུར་པ་དང་ཉེ་བར་འཚོ་བ་ཡིན་ཏེ།
en: Even after they pass into nirvāṇa, they continue to benefit beings and take care of them.

source: གང་དག་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་སྤོས་དང་། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཀྱིས་བཀུར་སྟིར་བྱེད།
en: Whoever venerates, respects, honors, and pays homage to the stūpa of a thus-gone one by offering incense, flowers, garlands, ointments, powders, garments, parasols, flags, and banners to it produces roots of virtue that make them destined for nirvāṇa.

source: བླ་མར་བྱེད། རི་མོར་བྱེད། མཆོད་པ་བྱེད་དེ། དེ་ལྟར་དགེ་བའི་རྩ་བ་བསྐྱེད་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་ཆོས་ཅན་དུ་འགྱུར་རོ། །གང་དག་འདོད་ཆགས་དང་བྲལ་བའི་བསམ་པས་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་མེ་ཏོག་གཅིག་ཙམ་འབུལ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱིས་མྱ་ངན་ལས་འདའ་བའི་ཆོས་ཅན་དུ་ལུང་བསྟན་ཏོ།
en: Whoever offers a single flower to the stūpa of a thus-gone one without any feelings of attachment has been prophesied by the Blessed One to be destined for nirvāṇa. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འདུག་ན་ཡང་སེམས་ཅན་རྣམས་ཀྱི་ཕན་འདོགས་པར་གྱུར་པ་དང་ཉེ་བར་འཚོ་བ་ཡིན་ལ།
en: Venerable Pūrṇa, this is how bodhisattva great beings benefit and take care of others while they are present.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་ན་ཡང་སེམས་ཅན་རྣམས་ཀྱིས་ཕན་འདོགས་པ་དང་ཉེ་བར་འཚོ་བ་ཡིན་ཏེ།
en: Likewise, even as they awaken to unsurpassed and perfect buddhahood and pass into nirvāṇa, they benefit and take care of beings.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ནམས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བར་མི་འགྱུར་བ་མ་ཡིན་ནོ།
en: There is, in fact, no time at all when bodhisattva great beings do not take care of others.

source: །དེ་བཞིན་གཤེགས་པ་མ་གཏོགས་པར་སེམས་ཅན་གྱི་རིས་ན་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་འདི་ལྟ་བུ་དག་དང་ལྡན་པའི་སེམས་ཅན་དེ་གང་ཡང་མི་དམིགས་ཏེ།
en: Apart from a thus-gone one, there is no other being that can be seen to possess the qualities of a bodhisattva.

source: ཡོད་ཅེས་བྱ་བ་ནི་གནས་མེད་དོ།
en: It would be impossible for anyone else to have such qualities. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན་གསེར་ནི་བསྲེགས་ཀྱང་རུང་།
en: Venerable Pūrṇa, think of gold.

source: མ་བསྲེགས་ཀྱང་རུང་སྟེ། སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བ་ཡིན། བཞུ་ཡང་རུང་།
en: Whether it is heated or not, it can still provide for beings’ livelihood.

source: མ་བཞུ་ཡང་རུང་། བརྡུངས་སུ་བྱས་ཀྱང་རུང་། བརྡུངས་སུ་མ་བྱས་ཀྱང་རུང་སྟེ། སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བ་ཡིན་ནོ།
en: Whether it is melted or not, or beaten or not, it can still provide for beings’ livelihood.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་ཡང་སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བ་ཡིན་ལ།
en: Venerable Pūrṇa, the actions of bodhisattva great beings for the sake of awakening can provide for beings’ livelihood in the same way.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་ན་ཡང་སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བ་ཡིན་ནོ།
en: Moreover, as they awaken to unsurpassed and perfect buddhahood and pass into nirvāṇa, they continue to provide for beings. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན་ཟླ་བ་དང་ཉི་མ་གཉིས་ནི་གླིང་བཞི་པོ་དག་ཏུ་སེམས་ཅན་རྣམས་ཀྱི་བྱ་བ་བྱེད་ཅིང་གླིང་བཞི་པོ་དག་གི་ཉེ་བར་འཚོ་བ་ཡིན་ཏེ།
en: Venerable Pūrṇa, think of the moon and the sun and how they sustain the four continents, and how because of them the beings on all four continents can carry out their activities.
